sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_hal_aci.h
tBleStatus aci_hal_get_updater_bufsize(uint8_t *Buffer_Size);
/**
 * @brief This command erases the BLUE flag in the Flash. After this operation,
 *        the updater cannot jump to the firmware until the BLUE flag is set to
 *        a valid value with ACI_HAL_UPDATER_RESET_BLUE_FLAG. This command is
 *        strongly recommended when the updater wants to upgrade the firmware
 *        application.
 * @retval Value indicating success or error code.
 */
tBleStatus aci_hal_updater_erase_blue_flag(void);
/**
 * @brief Reset the BLUE flag to its proper value. This command must be called
 *        when the firmware upgrade is finished. So that after reboot, the
 *        update may jump to the firmware application.
 * @retval Value indicating success or error code.
 */
tBleStatus aci_hal_updater_reset_blue_flag(void);
/**
 * @brief This command erases one sector of the Flash memory. One sector is 2
 *        KB. After erasing, the sector will be all 0xFF.
 * @param Address
 * @retval Value indicating success or error code.
 */
tBleStatus aci_hal_updater_erase_sector(uint32_t Address);
/**
 * @brief This command writes a block of data to the Flash, starting from the
 *        given base address.
 * @param Address
 * @param Data_Length Length of Data in octets
 * @param Data
 * @retval Value indicating success or error code.
 */
tBleStatus aci_hal_updater_prog_data_blk(uint32_t Address,
                                         uint16_t Data_Length,
                                         uint8_t Data[]);
/**
 * @brief This command reads a block of data from the Flash, starting from the
 *        given base address. For it is only allowed to read from the IFR flash.
 *        So the Base Address must be bigger than 0x10020000.
 * @param Address
 * @param Data_Length
 * @param[out] Data
 * @retval Value indicating success or error code.
 */
tBleStatus aci_hal_updater_read_data_blk(uint32_t Address,
                                         uint16_t Data_Length,
                                         uint8_t Data[]);
/**
 * @brief It calculates the CRC32 of one or more Flash sectors. One Flash sector
 *        is 2 KB
 * @param Address
 * @param Num_Of_Sectors
 * @param[out] crc
 * @retval Value indicating success or error code.
 */
tBleStatus aci_hal_updater_calc_crc(uint32_t Address,
                                    uint8_t Num_Of_Sectors,
                                    uint32_t *crc);
/**
 * @brief It gives device ID and cut version. See DIE_ID register.
 * @param[out] HW_Version It is the content of Die ID register.
 * @retval Value indicating success or error code.
 */
tBleStatus aci_hal_updater_hw_version(uint8_t *HW_Version);
/**
 * @brief This command is equivalent to the corresponding Bluetooth Low Energy
 *        standard command HCI_LE_TRANSMITTER_TEST, with an additional parameter
 *        to specify the number of packets to be transmitted. An
 *        HCI_COMMAND_STATUS_EVENT is sent after the command is received. An
 *        ACI_HAL_LE_TEST_END_EVENT is generated when the number of specified
 *        packets have been sent.
 * @param TX_Frequency N = (F - 2402) / 2. Frequency Range : 2402 MHz to 2480
 *        MHz
 *        Values:
 *        - 0x00 ... 0x27
 * @param Length_Of_Test_Data Length in bytes of payload data in each packet.
 *        Supported ranges: - (0x00,0x25): with  BLE stack version < 2.1
 *                          - (0x00,0xFF): with BLE stackversion >= 2.1 and extended packet length.      
 *        Values:
 *        - 0x00 ... 0xFF
 * @param Packet_Payload Type of packet payload.
 *        Values:
 *        - 0x00: Pseudo-Random bit sequence 9
 *        - 0x01: Pattern of alternating bits '11110000'
 *        - 0x02: Pattern of alternating bits '10101010'
 *        - 0x03: Pseudo-Random bit sequence 15
 *        - 0x04: Pattern of All '1' bits
 *        - 0x05: Pattern of All '0' bits
 *        - 0x06: Pattern of alternating bits '00001111'
 *        - 0x07: Pattern of alternating bits '0101'
 * @param Number_Of_Packets Number of packets to be sent
 * @param PHY PHY to be used by the transmitter.
 *        Values:
 *        - 0x01: LE_1M_PHY
 *        - 0x02: LE_2M_PHY
 *        - 0x03: LE_CODED_PHY_S8
 *        - 0x04: LE_CODED_PHY_S2
 * @retval Value indicating success or error code.
 */
tBleStatus aci_hal_transmitter_test_packets(uint8_t TX_Frequency,
                                            uint8_t Length_Of_Test_Data,
                                            uint8_t Packet_Payload,
                                            uint16_t Number_Of_Packets,
                                            uint8_t PHY);
/**
 * @brief This command is equivalent to the corresponding Bluetooth Low Energy
 *        standard command HCI_LE_TRANSMITTER_TEST_V3, with an additional
 *        parameter to specify the number of packets to be transmitted. An
 *        HCI_COMMAND_STATUS_EVENT is sent after the command is received. An
 *        ACI_HAL_LE_TEST_END_EVENT is generated when the number of specified
 *        packets have been sent.
 * @param TX_Channel N = (F - 2402) / 2. Frequency Range : 2402 MHz to 2480 MHz
 *        Values:
 *        - 0x00 ... 0x27
 * @param Test_Data_Length Length in bytes of payload data in each packet.
 * @param Packet_Payload Content of the Payload of the test reference packets.
 *        0: PRBS9 sequence '11111111100000111101...' (in transmission order) 1:
 *        Repeated '11110000' (in transmission order) sequence 2: Repeated
 *        '10101010' (in transmission order) sequence 3: PRBS15 sequence 4:
 *        Repeated '11111111' (in transmission order) sequence 5: Repeated
 *        '00000000' (in transmission order) sequence 6: Repeated '00001111' (in
 *        transmission order) sequence 7: Repeated '01010101' (in transmission
 *        order) sequence
 *        Values:
 *        - 0x00: PRBS9
 *        - 0x01: Repeated '11110000'
 *        - 0x02: Repeated '10101010'
 *        - 0x03: PRBS15
 *        - 0x04: Repeated '11111111'
 *        - 0x05: Repeated '00000000'
 *        - 0x06: Repeated '00001111'
 *        - 0x07: Repeated '01010101'
 * @param Number_Of_Packets Number of packets to be sent.
 * @param PHY PHY to be used by the transmitter.
 *        Values:
 *        - 0x01: LE_1M_PHY
 *        - 0x02: LE_2M_PHY
 *        - 0x03: LE_CODED_PHY_S8
 *        - 0x04: LE_CODED_PHY_S2
 * @param CTE_Length Expected length of the Constant Tone Extension in 8
 *        microseconds units. If 0, no Constant Tone Extension expected.
 *        Values:
 *        - 0x00
 *        - 0x02 ... 0x14
 * @param CTE_Type Type of the Constant Tone Extension in the test reference
 *        packets. 0: AoA; 1: AoD with 1 us slots; 2: AoD with 2 us slots.
 *        Values:
 *        - 0x00: CTE_AOA
 *        - 0x01: CTE_AOD_1us
 *        - 0x02: CTE_AOD_2us
 * @param Switching_Pattern_Length The number of Antenna IDs in the pattern.
 *        Values:
 *        - 0x02 ... 0x4B
 * @param Antenna_IDs List of Antenna IDs in the pattern.
 * @retval Value indicating success or error code.
 */
tBleStatus aci_hal_transmitter_test_packets_v2(uint8_t TX_Channel,
                                               uint8_t Test_Data_Length,
                                               uint8_t Packet_Payload,
                                               uint16_t Number_Of_Packets,
                                               uint8_t PHY,
                                               uint8_t CTE_Length,
                                               uint8_t CTE_Type,
                                               uint8_t Switching_Pattern_Length,
                                               uint8_t Antenna_IDs[]);
/**
 * @brief
 * @param Start_Address
 * @param Num_Bytes Length of Data in octets
 * @param Data
 * @retval Value indicating success or error code.
 */
tBleStatus aci_hal_write_radio_reg(uint32_t Start_Address,
                                   uint8_t Num_Bytes,
                                   uint8_t Data[]);
/**
 * @brief
 * @param Start_Address
 * @param Num_Bytes
 * @param[out] Data_Length Length of Data in octets
 * @param[out] Data
 * @retval Value indicating success or error code.
 */
tBleStatus aci_hal_read_radio_reg(uint32_t Start_Address,
                                  uint8_t Num_Bytes,
                                  uint8_t *Data_Length,
                                  uint8_t Data[]);
/**
 * @brief This command is used to enable ANTENNA_ID signal by enabling the
 *        Alternate Function on the corresponding pins. Some IOs may not be
 *        enabled, depending on resources availability (e.g. IOs used for
 *        communication). Any GPIO not selected with the Antenna_IDs mask is not
 *        configured. A system reset is needed to restore GPIOs state to its
 *        default value (floating).
 * @param Antenna_IDs ANTENNA_ID pins to be enabled. Each bit in the mask
 *        enables the corresponding bit of the ANTENNA_ID signal, which is
 *        output on PB[0:6].
 *        Flags:
 *        - 0x01: ANTENNA_ID_0
 *        - 0x02: ANTENNA_ID_1
 *        - 0x04: ANTENNA_ID_2
 *        - 0x08: ANTENNA_ID_3
 *        - 0x10: ANTENNA_ID_4
 *        - 0x20: ANTENNA_ID_5
 *        - 0x40: ANTENNA_ID_6
 * @param Antenna_ID_Shift This parameter can be set to a value different from
 *        zero to left shift the ANTENNA_ID signal by the given number of bits.
 *        This number does not affect the pin selected by Antenna_IDs parameter.
 *        E.g. to have the ANTENNA_ID signal output on PB[2:4], set Antenna_IDs
 *        to enable ANTENNA_ID[2:4] (Antenna_IDs = 0x1C) and Antenna_ID_Shift to
 *        2.
 *        Values:
 *        - 0 ... 6
 * @param Default_Antenna_ID The ID of antenna that the controller will select
 *        for regular communication. The antenna to be used when sending or
 *        receiving the CTE field needs to be specified through the Antenna_IDs
 *        parameter of the dedicated HCI commands (i.e.
 *        hci_le_set_connectionless_cte_transmit_parameters,
 *        hci_le_set_connectionless_iq_sampling_enable,
 *        hci_le_set_connection_cte_receive_parameters and
 *        hci_le_set_connection_cte_transmit_parameters).
 *        Values:
 *        - 0x00 ... 0x7F
 * @param RF_Activity_Enable Enable or disable the RF Activity signal, if
 *        supported by the device. This signal can be used to enable the antenna
 *        switch only when necessary.
 *        Values:
 *        - 0x00: DISABLED
 *        - 0x01: ENABLED
 * @retval Value indicating success or error code.
 */
tBleStatus aci_hal_set_antenna_switch_parameters(uint8_t Antenna_IDs,
                                                 uint8_t Antenna_ID_Shift,
                                                 uint8_t Default_Antenna_ID,
                                                 uint8_t RF_Activity_Enable);
/**
 * @brief Command used on the peripheral to force the Link Layer to keep the
 *        peripheral latency disabled. Peripheral latency is enabled by default
 *        on a connection where peripheral latency has been set to a value
 *        greaten than zero by the Central when connection is established.
 *        Disabling the peripheral latency is useful to immediately reduce
 *        latency from Central to Peripheral. Note that when peripheral latency
 *        is enabled, the Link Layer will use the first available connection
 *        event to transfer the queued data, so there is no need to force the
 *        disabling of the peripheral latency to reduce latency from Peripheral
 *        to Central. This command returns BLE_ERROR_UNKNOWN_CONNECTION_ID if
 *        the connection handle does not exist. BLE_ERROR_COMMAND_DISALLOWED is
 *        returned if the command is given when the device is not in the
 *        peripheral role on the connection handle.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Enable Enable (1) or disable (0) the peripheral latency. Default value
 *        is Enabled (1).
 *        Values:
 *        - 0x00: DISABLED
 *        - 0x01: ENABLED
 * @retval Value indicating success or error code.
 */
tBleStatus aci_hal_peripheral_latency_enable(uint16_t Connection_Handle,
                                             uint8_t Enable);
/**
 * @brief This command can be used to get the maximum used size of the stack's
 *        internal FIFO queues: isr1_fifo, isr2_fifo and user_fifo. These values
 *        can be used to chose the maximum correct size for the queues, which
 *        can be set through the BLE_STACK_Init() function. If one of these
 *        queues reaches the maximum size, an hci_hardware_error_event is
 *        raised, with error code 0x03.
 * @param[out] ISR0_FIFO_Max_Level Maximum size reached by the FIFO used for
 *             critical controller events produced by the ISR (e.g. rx data
 *             packets). See isr0_fifo_size parameter field of
 *             BLE_STACK_InitTypeDef structure, used by BLE_STACK_Init().
 * @param[out] ISR1_FIFO_Max_Level Maximum size reached by the FIFO used for
 *             non-critical controller events produced by the ISR (e.g.
 *             advertising or IQ sampling reports). See isr1_fifo_size parameter
 *             field of BLE_STACK_InitTypeDef structure, used by
 *             BLE_STACK_Init().
 * @param[out] User_FIFO_Max_Level Maximum size reached by the FIFO used for
 *             controller and host events produced outside the ISR. See
 *             user_fifo_size parameter field of BLE_STACK_InitTypeDef
 *             structure, used by BLE_STACK_Init().
 * @retval Value indicating success or error code.
 */
tBleStatus aci_hal_get_evt_fifo_max_level(uint16_t *ISR0_FIFO_Max_Level,
                                          uint16_t *ISR1_FIFO_Max_Level,
                                          uint16_t *User_FIFO_Max_Level);
/**
 * @brief
 * @param Connection_Handle Connection handle to notify.
 * @param Service_Handle Handle of service to which the characteristic belongs
 *        Values:
 *        - 0x0001 ... 0xFFFF
 * @param Char_Handle Handle of the characteristic
 *        Values:
 *        - 0x0001 ... 0xFFFF
 * @param Value_Length Length of the characteristic to be notified. Only ATT_MTU
 *        - 3 bytes are sent with notifications.
 * @retval Value indicating success or error code.
 */
tBleStatus aci_test_tx_notification_start(uint16_t Connection_Handle,
                                          uint16_t Service_Handle,
                                          uint16_t Char_Handle,
                                          uint16_t Value_Length);
/**
 * @brief
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Attr_Handle Handle of the attribute to be written
 *        Values:
 *        - 0x0001 ... 0xFFFF
 * @param Value_Length Length of the characteristic to be written with write
 *        commands. Only ATT_MTU - 3 bytes are written.
 * @retval Value indicating success or error code.
 */
tBleStatus aci_test_tx_write_command_start(uint16_t Connection_Handle,
                                           uint16_t Attr_Handle,
                                           uint16_t Value_Length);
/**
 * @brief
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Attr_Handle Handle of the attribute to be written
 *        Values:
 *        - 0x0001 ... 0xFFFF
 * @param Notifications_WriteCmds
 *        Values:
 *        - 0x00: Notifications
 *        - 0x01: Write Commands
 * @retval Value indicating success or error code.
 */
tBleStatus aci_test_rx_start(uint16_t Connection_Handle,
                             uint16_t Attr_Handle,
                             uint8_t Notifications_WriteCmds);
/**
 * @brief
 * @param TX_RX
 *        Values:
 *        - 0x00: TX
 *        - 0x01: RX
 * @retval Value indicating success or error code.
 */
tBleStatus aci_test_stop(uint8_t TX_RX);
/**
 * @brief
 * @param[out] TX_Packets
 * @param[out] RX_Packets
 * @param[out] RX_Data_Length
 * @param[out] RX_Sequence_Errors
 * @retval Value indicating success or error code.
 */
tBleStatus aci_test_report(uint32_t *TX_Packets,
                           uint32_t *RX_Packets,
                           uint16_t *RX_Data_Length,
                           uint32_t *RX_Sequence_Errors);
/**
     * @}
     */
    #endif /* _STM32WB05N_HAL_ACI_H_ */
